probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FSMC</name>
      <description>Flexible static memory controller</description>
      <groupName>FSMC</groupName>
      <baseAddress>0xA0000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FSMC</name>
        <description>FSMC global interrupt</description>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>BCR1</name>
          <displayName>BCR1</displayName>
          <description>SRAM/NOR-Flash chip-select control register
          1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D0</resetValue>
          <fields>
            <field>
              <name>CBURSTRW</name>
              <description>CBURSTRW</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CBURSTRW</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Write operations are performed in synchronous mode</description><value>1</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Write operations are always performed in asynchronous mode</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>ASYNCWAIT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ASYNCWAIT</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wait signal not used in asynchronous mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wait signal used even in asynchronous mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>EXTMOD</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EXTMOD</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Values inside the FMC_BWTR are not taken into account</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Values inside the FMC_BWTR are taken into account</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAITEN</name>
              <description>WAITEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAITEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Values inside the FMC_BWTR are taken into account</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>NWAIT signal enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>WREN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WREN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Write operations disabled for the bank by the FMC</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Write operations enabled for the bank by the FMC</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>WAITCFG</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAITCFG</name><usage>read-write</usage><enumeratedValue><name>BeforeWaitState</name><description>NWAIT signal is active one data cycle before wait state</description><value>0</value></enumeratedValue><enumeratedValue><name>DuringWaitState</name><description>NWAIT signal is active during wait state</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>WAITPOL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAITPOL</name><usage>read-write</usage><enumeratedValue><name>ActiveLow</name><description>NWAIT active low</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveHigh</name><description>NWAIT active high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>BURSTEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BURSTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Burst mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Burst mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FACCEN</name>
              <description>FACCEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FACCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Corresponding NOR Flash memory access is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Corresponding NOR Flash memory access is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MWID</name>
              <description>MWID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>MWID</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>Memory data bus width 8 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>Memory data bus width 16 bits</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>Memory data bus width 32 bits</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MTYP</name>
              <description>MTYP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>MTYP</name><usage>read-write</usage><enumeratedValue><name>SRAM</name><description>SRAM memory type</description><value>0</value></enumeratedValue><enumeratedValue><name>PSRAM</name><description>PSRAM (CRAM) memory type</description><value>1</value></enumeratedValue><enumeratedValue><name>Flash</name><description>NOR Flash/OneNAND Flash</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUXEN</name>
              <description>MUXEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MUXEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Address/Data non-multiplexed</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Address/Data multiplexed on databus</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MBKEN</name>
              <description>MBKEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MBKEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Corresponding memory bank is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Corresponding memory bank is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          <field><name>WRAPMOD</name><description>WRAPMOD</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CPSIZE</name><description>CRAM page size</description><bitOffset>16</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><name>CPSIZE</name><usage>read-write</usage><enumeratedValue><name>NoBurstSplit</name><description>No burst split when crossing page boundary</description><value>0</value></enumeratedValue><enumeratedValue><name>Bytes128</name><description>128 bytes CRAM page size</description><value>1</value></enumeratedValue><enumeratedValue><name>Bytes256</name><description>256 bytes CRAM page size</description><value>2</value></enumeratedValue><enumeratedValue><name>Bytes512</name><description>512 bytes CRAM page size</description><value>3</value></enumeratedValue><enumeratedValue><name>Bytes1024</name><description>1024 bytes CRAM page size</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        </register>
