probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
        <register>
          <name>BTR%s</name>
          <displayName>BTR1</displayName>
          <description>SRAM/NOR-Flash chip-select timing register
          1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ACCMOD</name>
              <description>ACCMOD</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>ACCMOD</name><usage>read-write</usage><enumeratedValue><name>A</name><description>Access mode A</description><value>0</value></enumeratedValue><enumeratedValue><name>B</name><description>Access mode B</description><value>1</value></enumeratedValue><enumeratedValue><name>C</name><description>Access mode C</description><value>2</value></enumeratedValue><enumeratedValue><name>D</name><description>Access mode D</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DATLAT</name>
              <description>DATLAT</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>BUSTURN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DATAST</name>
              <description>DATAST</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>ADDHLD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ADDSET</name>
              <description>ADDSET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
          </fields>
        <dim>4</dim><dimIndex>1,2,3,4</dimIndex><dimIncrement>0x8</dimIncrement></register>
        <register>
          <name>BCR%s</name>
          <displayName>BCR2</displayName>
          <description>SRAM/NOR-Flash chip-select control register
          2</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D0</resetValue>
          <fields>
            <field>
              <name>CBURSTRW</name>
              <description>CBURSTRW</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CBURSTRW</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Write operations are performed in synchronous mode</description><value>1</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Write operations are always performed in asynchronous mode</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>ASYNCWAIT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ASYNCWAIT</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wait signal not used in asynchronous mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wait signal used even in asynchronous mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>EXTMOD</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EXTMOD</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Values inside the FMC_BWTR are not taken into account</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Values inside the FMC_BWTR are taken into account</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAITEN</name>
              <description>WAITEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAITEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Values inside the FMC_BWTR are taken into account</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>NWAIT signal enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>WREN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WREN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Write operations disabled for the bank by the FMC</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Write operations enabled for the bank by the FMC</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>WAITCFG</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAITCFG</name><usage>read-write</usage><enumeratedValue><name>BeforeWaitState</name><description>NWAIT signal is active one data cycle before wait state</description><value>0</value></enumeratedValue><enumeratedValue><name>DuringWaitState</name><description>NWAIT signal is active during wait state</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WRAPMOD</name>
              <description>WRAPMOD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>WAITPOL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAITPOL</name><usage>read-write</usage><enumeratedValue><name>ActiveLow</name><description>NWAIT active low</description><value>0</value></enumeratedValue><enumeratedValue><name>ActiveHigh</name><description>NWAIT active high</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>BURSTEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BURSTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Burst mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Burst mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FACCEN</name>
              <description>FACCEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FACCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Corresponding NOR Flash memory access is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Corresponding NOR Flash memory access is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MWID</name>
              <description>MWID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>MWID</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>Memory data bus width 8 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>Memory data bus width 16 bits</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>Memory data bus width 32 bits</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MTYP</name>
              <description>MTYP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>MTYP</name><usage>read-write</usage><enumeratedValue><name>SRAM</name><description>SRAM memory type</description><value>0</value></enumeratedValue><enumeratedValue><name>PSRAM</name><description>PSRAM (CRAM) memory type</description><value>1</value></enumeratedValue><enumeratedValue><name>Flash</name><description>NOR Flash/OneNAND Flash</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUXEN</name>
              <description>MUXEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MUXEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Address/Data non-multiplexed</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Address/Data multiplexed on databus</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MBKEN</name>
              <description>MBKEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MBKEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Corresponding memory bank is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Corresponding memory bank is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          <field><name>CPSIZE</name><description>CRAM page size</description><bitOffset>16</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><name>CPSIZE</name><usage>read-write</usage><enumeratedValue><name>NoBurstSplit</name><description>No burst split when crossing page boundary</description><value>0</value></enumeratedValue><enumeratedValue><name>Bytes128</name><description>128 bytes CRAM page size</description><value>1</value></enumeratedValue><enumeratedValue><name>Bytes256</name><description>256 bytes CRAM page size</description><value>2</value></enumeratedValue><enumeratedValue><name>Bytes512</name><description>512 bytes CRAM page size</description><value>3</value></enumeratedValue><enumeratedValue><name>Bytes1024</name><description>1024 bytes CRAM page size</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        <dim>3</dim><dimIndex>2,3,4</dimIndex><dimIncrement>0x8</dimIncrement></register>
        <register>
          <name>PCR%s</name>
          <displayName>PCR2</displayName>
          <description>PC Card/NAND Flash control register
          2</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>ECCPS</name>
              <description>ECCPS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>ECCPS</name><usage>read-write</usage><enumeratedValue><name>Bytes256</name><description>ECC page size 256 bytes</description><value>0</value></enumeratedValue><enumeratedValue><name>Bytes512</name><description>ECC page size 512 bytes</description><value>1</value></enumeratedValue><enumeratedValue><name>Bytes1024</name><description>ECC page size 1024 bytes</description><value>2</value></enumeratedValue><enumeratedValue><name>Bytes2048</name><description>ECC page size 2048 bytes</description><value>3</value></enumeratedValue><enumeratedValue><name>Bytes4096</name><description>ECC page size 4096 bytes</description><value>4</value></enumeratedValue><enumeratedValue><name>Bytes8192</name><description>ECC page size 8192 bytes</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TAR</name>
              <description>TAR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>TCLR</name>
              <description>TCLR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECCEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ECCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ECC logic is disabled and reset</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ECC logic is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PWID</name>
              <description>PWID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PWID</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>External memory device width 8 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>External memory device width 16 bits</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PTYP</name>
              <description>PTYP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PTYP</name><usage>read-write</usage><enumeratedValue><name>NANDFlash</name><description>NAND Flash</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PBKEN</name>
              <description>PBKEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PBKEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Corresponding memory bank is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Corresponding memory bank is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PWAITEN</name>
              <description>PWAITEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PWAITEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wait feature disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wait feature enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        <dim>3</dim><dimIndex>2,3,4</dimIndex><dimIncrement>0x20</dimIncrement></register>
        <register>
          <name>SR%s</name>
          <displayName>SR2</displayName>
          <description>FIFO status and interrupt register
          2</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>FEMPT</name>
              <description>FEMPT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>FEMPT</name><usage>read-write</usage><enumeratedValue><name>NotEmpty</name><description>FIFO not empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>FIFO empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IFEN</name>
              <description>IFEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>IFEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt falling edge detection request disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt falling edge detection request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ILEN</name>
              <description>ILEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ILEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt high-level detection request disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt high-level detection request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IREN</name>
              <description>IREN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>IREN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt rising edge detection request disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt rising edge detection request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IFS</name>
              <description>IFS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>IFS</name><usage>read-write</usage><enumeratedValue><name>DidNotOccur</name><description>Interrupt falling edge did not occur</description><value>0</value></enumeratedValue><enumeratedValue><name>Occurred</name><description>Interrupt falling edge occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ILS</name>
              <description>ILS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ILS</name><usage>read-write</usage><enumeratedValue><name>DidNotOccur</name><description>Interrupt high-level did not occur</description><value>0</value></enumeratedValue><enumeratedValue><name>Occurred</name><description>Interrupt high-level occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IRS</name>
              <description>IRS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>IRS</name><usage>read-write</usage><enumeratedValue><name>DidNotOccur</name><description>Interrupt rising edge did not occur</description><value>0</value></enumeratedValue><enumeratedValue><name>Occurred</name><description>Interrupt rising edge occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        <dim>3</dim><dimIndex>2,3,4</dimIndex><dimIncrement>0x20</dimIncrement></register>
        <register>
          <name>PMEM2</name>
          <displayName>PMEM2</displayName>
          <description>Common memory space timing register
          2</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>MEMHIZ</name>
              <description>MEMHIZx</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMHOLD</name>
              <description>MEMHOLDx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMWAIT</name>
              <description>MEMWAITx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMSET</name>
              <description>MEMSETx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
