probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
        <dim>8</dim><dimIndex>0,1,2,3,4,5,6,7</dimIndex><dimIncrement>0x18</dimIncrement></cluster></registers>
    </peripheral>
    <peripheral derivedFrom="DMA2">
      <name>DMA1</name>
      <baseAddress>0x40026000</baseAddress>
      <interrupt>
        <name>DMA1_Stream0</name>
        <description>DMA1 Stream0 global interrupt</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Stream1</name>
        <description>DMA1 Stream1 global interrupt</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Stream2</name>
        <description>DMA1 Stream2 global interrupt</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Stream3</name>
        <description>DMA1 Stream3 global interrupt</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Stream4</name>
        <description>DMA1 Stream4 global interrupt</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Stream5</name>
        <description>DMA1 Stream5 global interrupt</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Stream6</name>
        <description>DMA1 Stream6 global interrupt</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Stream7</name>
        <description>DMA1 Stream7 global interrupt</description>
        <value>47</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and clock control</description>
      <groupName>RCC</groupName>
      <baseAddress>0x40023800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC</name>
        <description>RCC global interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>clock control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000083</resetValue>
          <fields>
            <field>
              <name>PLLI2SRDY</name>
              <description>PLLI2S clock ready flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>PLLI2SRDYR</name><usage>read</usage><enumeratedValue><name>NotReady</name><description>Clock not ready</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>Clock ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PLLI2SON</name>
              <description>PLLI2S enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>PLLI2SON</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>Clock Off</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>Clock On</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>Main PLL (PLL) clock ready
              flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues derivedFrom="PLLI2SRDYR" />
            </field>
            <field>
              <name>PLLON</name>
              <description>Main PLL (PLL) enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues derivedFrom="PLLI2SON" />
            </field>
            <field>
              <name>CSSON</name>
              <description>Clock security system
              enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>CSSON</name><usage>read-write</usage><enumeratedValue><name>Off</name><description>Clock security system disabled (clock detector OFF)</description><value>0</value></enumeratedValue><enumeratedValue><name>On</name><description>Clock security system enable (clock detector ON if the HSE is ready, OFF if not)</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues derivedFrom="PLLI2SON" />
            </field>
            <field>
              <name>HSEBYP</name>
              <description>HSE clock bypass</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>HSEBYP</name><usage>read-write</usage><enumeratedValue><name>NotBypassed</name><description>HSE crystal oscillator not bypassed</description><value>0</value></enumeratedValue><enumeratedValue><name>Bypassed</name><description>HSE crystal oscillator bypassed with external clock</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSE clock ready flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues derivedFrom="PLLI2SRDYR" />
            </field>
            <field>
              <name>HSEON</name>
              <description>HSE clock enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues derivedFrom="PLLI2SON" />
            </field>
            <field>
              <name>HSICAL</name>
              <description>Internal high-speed clock
              calibration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>HSITRIM</name>
              <description>Internal high-speed clock
              trimming</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>Internal high-speed clock ready
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues derivedFrom="PLLI2SRDYR" />
            </field>
            <field>
              <name>HSION</name>
              <description>Internal high-speed clock
              enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues derivedFrom="PLLI2SON" />
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>PLL configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x24003010</resetValue>
          <fields>
            <field>
              <name>PLLSRC</name>
              <description>Main PLL(PLL) and audio PLL (PLLI2S)
              entry clock source</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PLLSRC</name><usage>read-write</usage><enumeratedValue><name>HSI</name><description>HSI clock selected as PLL and PLLI2S clock entry</description><value>0</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE oscillator clock selected as PLL and PLLI2S clock entry</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>PLLM</name><description>Division factor for the main PLL (PLL)
              and audio PLL (PLLI2S) input clock</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth><writeConstraint><range><minimum>2</minimum><maximum>63</maximum></range></writeConstraint>
            </field><field><name>PLLN</name><description>Main PLL (PLL) multiplication factor for
              VCO</description><bitOffset>6</bitOffset><bitWidth>9</bitWidth><writeConstraint><range><minimum>50</minimum><maximum>432</maximum></range></writeConstraint>
            </field><field><name>PLLP</name><description>Main PLL (PLL) division factor for main
              system clock</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><enumeratedValues><name>PLLP</name><usage>read-write</usage><enumeratedValue><name>Div2</name><description>PLLP=2</description><value>0</value></enumeratedValue><enumeratedValue><name>Div4</name><description>PLLP=4</description><value>1</value></enumeratedValue><enumeratedValue><name>Div6</name><description>PLLP=6</description><value>2</value></enumeratedValue><enumeratedValue><name>Div8</name><description>PLLP=8</description><value>3</value></enumeratedValue></enumeratedValues>
            </field><field><name>PLLQ</name><description>Main PLL (PLL) division factor for USB
              OTG FS, SDIO and random number generator
              clocks</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth><writeConstraint><range><minimum>2</minimum><maximum>15</maximum></range></writeConstraint>
            </field></fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>clock configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCO2</name>
              <description>Microcontroller clock output
              2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>MCO2</name><usage>read-write</usage><enumeratedValue><name>SYSCLK</name><description>System clock (SYSCLK) selected</description><value>0</value></enumeratedValue><enumeratedValue><name>PLLI2S</name><description>PLLI2S clock selected</description><value>1</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE oscillator clock selected</description><value>2</value></enumeratedValue><enumeratedValue><name>PLL</name><description>PLL clock selected</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MCO2PRE</name>
              <description>MCO2 prescaler</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>MCO2PRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>No division</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>Division by 2</description><value>4</value></enumeratedValue><enumeratedValue><name>Div3</name><description>Division by 3</description><value>5</value></enumeratedValue><enumeratedValue><name>Div4</name><description>Division by 4</description><value>6</value></enumeratedValue><enumeratedValue><name>Div5</name><description>Division by 5</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MCO1PRE</name>
              <description>MCO1 prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            <enumeratedValues derivedFrom="MCO2PRE" />
            </field>
            <field>
              <name>I2SSRC</name>
              <description>I2S clock selection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>I2SSRC</name><usage>read-write</usage><enumeratedValue><name>PLLI2S</name><description>PLLI2S clock used as I2S clock source</description><value>0</value></enumeratedValue><enumeratedValue><name>CKIN</name><description>External clock mapped on the I2S_CKIN pin used as I2S clock source</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MCO1</name>
              <description>Microcontroller clock output
              1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>MCO1</name><usage>read-write</usage><enumeratedValue><name>HSI</name><description>HSI clock selected</description><value>0</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE oscillator selected</description><value>1</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE oscillator clock selected</description><value>2</value></enumeratedValue><enumeratedValue><name>PLL</name><description>PLL clock selected</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RTCPRE</name>
              <description>HSE division factor for RTC
              clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>PPRE2</name>
              <description>APB high-speed prescaler
              (APB2)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>PPRE2</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>HCLK not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>HCLK divided by 2</description><value>4</value></enumeratedValue><enumeratedValue><name>Div4</name><description>HCLK divided by 4</description><value>5</value></enumeratedValue><enumeratedValue><name>Div8</name><description>HCLK divided by 8</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>HCLK divided by 16</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PPRE1</name>
              <description>APB Low speed prescaler
              (APB1)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            <enumeratedValues derivedFrom="PPRE2" />
            </field>
            <field>
              <name>HPRE</name>
              <description>AHB prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>HPRE</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>SYSCLK not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>SYSCLK divided by 2</description><value>8</value></enumeratedValue><enumeratedValue><name>Div4</name><description>SYSCLK divided by 4</description><value>9</value></enumeratedValue><enumeratedValue><name>Div8</name><description>SYSCLK divided by 8</description><value>10</value></enumeratedValue><enumeratedValue><name>Div16</name><description>SYSCLK divided by 16</description><value>11</value></enumeratedValue><enumeratedValue><name>Div64</name><description>SYSCLK divided by 64</description><value>12</value></enumeratedValue><enumeratedValue><name>Div128</name><description>SYSCLK divided by 128</description><value>13</value></enumeratedValue><enumeratedValue><name>Div256</name><description>SYSCLK divided by 256</description><value>14</value></enumeratedValue><enumeratedValue><name>Div512</name><description>SYSCLK divided by 512</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>SW</name><description>System clock switch</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><name>SW</name><usage>read-write</usage><enumeratedValue><name>HSI</name><description>HSI selected as system clock</description><value>0</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE selected as system clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL</name><description>PLL selected as system clock</description><value>2</value></enumeratedValue></enumeratedValues>
            </field><field><name>SWS</name><description>System clock switch status</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><enumeratedValues><name>SWSR</name><usage>read</usage><enumeratedValue><name>HSI</name><description>HSE oscillator used as system clock</description><value>0</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSI oscillator used as system clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL</name><description>PLL used as system clock</description><value>2</value></enumeratedValue></enumeratedValues>
            </field></fields>
        </register>
