probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global interrupt</description>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI3</name>
      <baseAddress>0x40003C00</baseAddress>
      <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>I2S2ext</name>
      <baseAddress>0x40003400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>I2S3ext</name>
      <baseAddress>0x40004000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI4</name>
      <baseAddress>0x40013400</baseAddress>
      <interrupt>
        <name>SPI1</name>
        <description>SPI1 global interrupt</description>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI5</name>
      <baseAddress>0x40015000</baseAddress>
      <interrupt>
        <name>SPI1</name>
        <description>SPI1 global interrupt</description>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI6</name>
      <baseAddress>0x40015400</baseAddress>
      <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SDIO</name>
      <description>Secure digital input/output
      interface</description>
      <groupName>SDIO</groupName>
      <baseAddress>0x40012C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SDIO</name>
        <description>SDIO global interrupt</description>
        <value>49</value>
      </interrupt>
      <registers>
        <register>
          <name>POWER</name>
          <displayName>POWER</displayName>
          <description>power control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRCTRL</name>
              <description>PWRCTRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PWRCTRL</name><usage>read-write</usage><enumeratedValue><name>PowerOff</name><description>Power off</description><value>0</value></enumeratedValue><enumeratedValue><name>PowerOn</name><description>Power on</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCR</name>
          <displayName>CLKCR</displayName>
          <description>SDI clock control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HWFC_EN</name>
              <description>HW Flow Control enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>HWFC_EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>HW Flow Control is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>HW Flow Control is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>NEGEDGE</name>
              <description>SDIO_CK dephasing selection
              bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>NEGEDGE</name><usage>read-write</usage><enumeratedValue><name>Rising</name><description>SDIO_CK generated on the rising edge</description><value>0</value></enumeratedValue><enumeratedValue><name>Falling</name><description>SDIO_CK generated on the falling edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WIDBUS</name>
              <description>Wide bus mode enable bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>WIDBUS</name><usage>read-write</usage><enumeratedValue><name>BusWidth1</name><description>1 lane wide bus</description><value>0</value></enumeratedValue><enumeratedValue><name>BusWidth4</name><description>4 lane wide bus</description><value>1</value></enumeratedValue><enumeratedValue><name>BusWidth8</name><description>8 lane wide bus</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Clock divider bypass enable
              bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BYPASS</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SDIOCLK is divided according to the CLKDIV value before driving the SDIO_CK output signal.</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SDIOCLK directly drives the SDIO_CK output signal</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PWRSAV</name>
              <description>Power saving configuration
              bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PWRSAV</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SDIO_CK is only enabled when the bus is active</description><value>1</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SDIO_CK clock is always enabled</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CLKEN</name>
              <description>Clock enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CLKEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disable clock</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable clock</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divide factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ARG</name>
          <displayName>ARG</displayName>
          <description>argument register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMDARG</name>
              <description>Command argument</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <displayName>CMD</displayName>
          <description>command register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CE_ATACMD</name>
              <description>CE-ATA command</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CE_ATACMD</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CE-ATA command disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CE-ATA command enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>nIEN</name>
              <description>not Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>nIEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupts to the CE-ATA not disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt to the CE-ATA are disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ENCMDcompl</name>
              <description>Enable CMD completion</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ENCMDcompl</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Command complete signal disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Command complete signal enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SDIOSuspend</name>
              <description>SD I/O suspend command</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SDIOSuspend</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Next command is not a SDIO suspend command</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Next command send is a SDIO suspend command</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CPSMEN</name>
              <description>Command path state machine (CPSM) Enable
              bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CPSMEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Command path state machine disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Command path state machine enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAITPEND</name>
              <description>CPSM Waits for ends of data transfer
              (CmdPend internal signal).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAITPEND</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Don't wait for data end</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wait for end of data transfer signal before sending command</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAITINT</name>
              <description>CPSM waits for interrupt
              request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WAITINT</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Don't wait for interrupt request</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wait for interrupt request</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WAITRESP</name>
              <description>Wait for response bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>WAITRESP</name><usage>read-write</usage><enumeratedValue><name>NoResponse</name><description>No response</description><value>0</value></enumeratedValue><enumeratedValue><name>ShortResponse</name><description>Short response</description><value>1</value></enumeratedValue><enumeratedValue><name>NoResponse2</name><description>No reponse</description><value>2</value></enumeratedValue><enumeratedValue><name>LongResponse</name><description>Long reponse</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMDINDEX</name>
              <description>Command index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RESPCMD</name>
          <displayName>RESPCMD</displayName>
          <description>command response register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESPCMD</name>
              <description>Response command index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP1</name>
          <displayName>RESP1</displayName>
          <description>response 1..4 register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS1</name>
              <description>see Table 132.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP2</name>
          <displayName>RESP2</displayName>
          <description>response 1..4 register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS2</name>
              <description>see Table 132.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP3</name>
          <displayName>RESP3</displayName>
          <description>response 1..4 register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS3</name>
              <description>see Table 132.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RESP4</name>
          <displayName>RESP4</displayName>
          <description>response 1..4 register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARDSTATUS4</name>
              <description>see Table 132.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DTIMER</name>
          <displayName>DTIMER</displayName>
          <description>data timer register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATATIME</name>
              <description>Data timeout period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DLEN</name>
          <displayName>DLEN</displayName>
          <description>data length register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATALENGTH</name>
              <description>Data length value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>33554431</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCTRL</name>
          <displayName>DCTRL</displayName>
          <description>data control register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIOEN</name>
              <description>SD I/O enable functions</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SDIOEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SDIO operations disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SDIO operations enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RWMOD</name>
              <description>Read wait mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RWMOD</name><usage>read-write</usage><enumeratedValue><name>D2</name><description>Read wait control stopping using SDIO_D2</description><value>0</value></enumeratedValue><enumeratedValue><name>Ck</name><description>Read wait control using SDIO_CK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RWSTOP</name>
              <description>Read wait stop</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RWSTOP</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Read wait in progress if RWSTART is enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable for read wait stop if RWSTART is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RWSTART</name>
              <description>Read wait start</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RWSTART</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Don't start read wait operation</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Read wait operation starts</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DBLOCKSIZE</name>
              <description>Data block size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Dma disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Dma enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DTMODE</name>
              <description>Data transfer mode selection 1: Stream
              or SDIO multibyte data transfer.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DTMODE</name><usage>read-write</usage><enumeratedValue><name>BlockMode</name><description>Bloack data transfer</description><value>0</value></enumeratedValue><enumeratedValue><name>StreamMode</name><description>Stream or SDIO multibyte data transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DTDIR</name>
              <description>Data transfer direction
              selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DTDIR</name><usage>read-write</usage><enumeratedValue><name>ControllerToCard</name><description>From controller to card</description><value>0</value></enumeratedValue><enumeratedValue><name>CardToController</name><description>From card to controller</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DTEN</name>
              <description>DTEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Start transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
