probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
        <register>
          <name>DCOUNT</name>
          <displayName>DCOUNT</displayName>
          <description>data counter register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATACOUNT</name>
              <description>Data count value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>33554431</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STA</name>
          <displayName>STA</displayName>
          <description>status register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEATAEND</name>
              <description>CE-ATA command completion signal
              received for CMD61</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CEATAEND</name><usage>read-write</usage><enumeratedValue><name>NotReceived</name><description>Completion signal not received</description><value>0</value></enumeratedValue><enumeratedValue><name>Received</name><description>CE-ATA command completion signal received for CMD61</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SDIOIT</name>
              <description>SDIO interrupt received</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SDIOIT</name><usage>read-write</usage><enumeratedValue><name>NotReceived</name><description>SDIO interrupt not receieved</description><value>0</value></enumeratedValue><enumeratedValue><name>Received</name><description>SDIO interrupt received</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXDAVL</name>
              <description>Data available in receive
              FIFO</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXDAVL</name><usage>read-write</usage><enumeratedValue><name>NotAvailable</name><description>Data not available in receive FIFO</description><value>0</value></enumeratedValue><enumeratedValue><name>Available</name><description>Data available in receive FIFO</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXDAVL</name>
              <description>Data available in transmit
              FIFO</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXDAVL</name><usage>read-write</usage><enumeratedValue><name>NotAvailable</name><description>Data not available in transmit FIFO</description><value>0</value></enumeratedValue><enumeratedValue><name>Available</name><description>Data available in transmit FIFO</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXFIFOE</name>
              <description>Receive FIFO empty</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXFIFOE</name><usage>read-write</usage><enumeratedValue><name>NotEmpty</name><description>Receive FIFO not empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>Receive FIFO empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXFIFOE</name>
              <description>Transmit FIFO empty</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXFIFOE</name><usage>read-write</usage><enumeratedValue><name>NotEmpty</name><description>Transmit FIFO not empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>Transmit FIFO empty. When HW Flow Control is enabled, TXFIFOE signals becomes activated when the FIFO contains 2 words.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXFIFOF</name>
              <description>Receive FIFO full</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXFIFOF</name><usage>read-write</usage><enumeratedValue><name>NotFull</name><description>Transmit FIFO not full</description><value>0</value></enumeratedValue><enumeratedValue><name>Full</name><description>Receive FIFO full. When HW Flow Control is enabled, RXFIFOF signals becomes activated 2 words before the FIFO is full.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXFIFOF</name>
              <description>Transmit FIFO full</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXFIFOF</name><usage>read-write</usage><enumeratedValue><name>NotFull</name><description>Transmit FIFO not full</description><value>0</value></enumeratedValue><enumeratedValue><name>Full</name><description>Transmit FIFO full</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXFIFOHF</name>
              <description>Receive FIFO half full: there are at
              least 8 words in the FIFO</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXFIFOHF</name><usage>read-write</usage><enumeratedValue><name>NotHalfFull</name><description>Receive FIFO not half full</description><value>0</value></enumeratedValue><enumeratedValue><name>HalfFull</name><description>Receive FIFO half full. At least 8 words in the FIFO</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXFIFOHE</name>
              <description>Transmit FIFO half empty: at least 8
              words can be written into the FIFO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXFIFOHE</name><usage>read-write</usage><enumeratedValue><name>NotHalfEmpty</name><description>Transmit FIFO not half empty</description><value>0</value></enumeratedValue><enumeratedValue><name>HalfEmpty</name><description>Transmit FIFO half empty. At least 8 words can be written into the FIFO</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXACT</name>
              <description>Data receive in progress</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXACT</name><usage>read-write</usage><enumeratedValue><name>NotInProgress</name><description>Data receive not in progress</description><value>0</value></enumeratedValue><enumeratedValue><name>InProgress</name><description>Data receive in progress</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXACT</name>
              <description>Data transmit in progress</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXACT</name><usage>read-write</usage><enumeratedValue><name>NotInProgress</name><description>Data transmit is not in progress</description><value>0</value></enumeratedValue><enumeratedValue><name>InProgress</name><description>Data transmit in progress</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMDACT</name>
              <description>Command transfer in
              progress</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMDACT</name><usage>read-write</usage><enumeratedValue><name>NotInProgress</name><description>Command transfer not in progress</description><value>0</value></enumeratedValue><enumeratedValue><name>InProgress</name><description>Command tranfer in progress</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DBCKEND</name>
              <description>Data block sent/received (CRC check
              passed)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DBCKEND</name><usage>read-write</usage><enumeratedValue><name>NotTransferred</name><description>Data block not sent/received (CRC check failed)</description><value>0</value></enumeratedValue><enumeratedValue><name>Transferred</name><description>Data block sent/received (CRC check passed)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>STBITERR</name>
              <description>Start bit not detected on all data
              signals in wide bus mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>STBITERR</name><usage>read-write</usage><enumeratedValue><name>Detected</name><description>No start bit detected error</description><value>0</value></enumeratedValue><enumeratedValue><name>NotDetected</name><description>Start bit not detected error</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DATAEND</name>
              <description>Data end (data counter, SDIDCOUNT, is
              zero)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DATAEND</name><usage>read-write</usage><enumeratedValue><name>Done</name><description>Data end (DCOUNT, is zero)</description><value>1</value></enumeratedValue><enumeratedValue><name>NotDone</name><description>Not done</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMDSENT</name>
              <description>Command sent (no response
              required)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMDSENT</name><usage>read-write</usage><enumeratedValue><name>NotSent</name><description>Command not sent</description><value>0</value></enumeratedValue><enumeratedValue><name>Sent</name><description>Command sent (no response required)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMDREND</name>
              <description>Command response received (CRC check
              passed)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMDREND</name><usage>read-write</usage><enumeratedValue><name>NotDone</name><description>Command not done</description><value>0</value></enumeratedValue><enumeratedValue><name>Done</name><description>Command response received (CRC check passed)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXOVERR</name>
              <description>Received FIFO overrun
              error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXOVERR</name><usage>read-write</usage><enumeratedValue><name>NoOverrun</name><description>No FIFO overrun error</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Receive FIFO overrun error</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXUNDERR</name>
              <description>Transmit FIFO underrun
              error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXUNDERR</name><usage>read-write</usage><enumeratedValue><name>NoUnderrun</name><description>No transmit FIFO underrun error</description><value>0</value></enumeratedValue><enumeratedValue><name>Underrun</name><description>Transmit FIFO underrun error</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DTIMEOUT</name>
              <description>Data timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DTIMEOUT</name><usage>read-write</usage><enumeratedValue><name>NoTimeout</name><description>No data timeout</description><value>0</value></enumeratedValue><enumeratedValue><name>Timeout</name><description>Data timeout</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CTIMEOUT</name>
              <description>Command response timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CTIMEOUT</name><usage>read-write</usage><enumeratedValue><name>NoTimeout</name><description>No Command timeout</description><value>0</value></enumeratedValue><enumeratedValue><name>Timeout</name><description>Command timeout</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DCRCFAIL</name>
              <description>Data block sent/received (CRC check
              failed)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DCRCFAIL</name><usage>read-write</usage><enumeratedValue><name>NotFailed</name><description>No Data block sent/received crc check fail</description><value>0</value></enumeratedValue><enumeratedValue><name>Failed</name><description>Data block sent/received crc failed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CCRCFAIL</name>
              <description>Command response received (CRC check
              failed)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CCRCFAIL</name><usage>read-write</usage><enumeratedValue><name>NotFailed</name><description>Command response received, crc check passed</description><value>0</value></enumeratedValue><enumeratedValue><name>Failed</name><description>Command response received, crc check failed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>interrupt clear register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CEATAENDC</name>
              <description>CEATAEND flag clear bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CEATAENDCW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SDIOITC</name>
              <description>SDIOIT flag clear bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>DBCKENDC</name>
              <description>DBCKEND flag clear bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>STBITERRC</name>
              <description>STBITERR flag clear bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>DATAENDC</name>
              <description>DATAEND flag clear bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>CMDSENTC</name>
              <description>CMDSENT flag clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>CMDRENDC</name>
              <description>CMDREND flag clear bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>RXOVERRC</name>
              <description>RXOVERR flag clear bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>TXUNDERRC</name>
              <description>TXUNDERR flag clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>DTIMEOUTC</name>
              <description>DTIMEOUT flag clear bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>CTIMEOUTC</name>
              <description>CTIMEOUT flag clear bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>DCRCFAILC</name>
              <description>DCRCFAIL flag clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
            <field>
              <name>CCRCFAILC</name>
              <description>CCRCFAIL flag clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CEATAENDCW" />
            </field>
          </fields>
        </register>
