probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
        <register>
          <name>SR1</name>
          <displayName>SR1</displayName>
          <description>Status register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>SMBALERT</name>
              <description>SMBus alert</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>SMBALERT</name><usage>read-write</usage><enumeratedValue><name>NoAlert</name><description>No SMBALERT occured</description><value>0</value></enumeratedValue><enumeratedValue><name>Alert</name><description>SMBALERT occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout or Tlow error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TIMEOUT</name><usage>read-write</usage><enumeratedValue><name>NoTimeout</name><description>No Timeout error</description><value>0</value></enumeratedValue><enumeratedValue><name>Timeout</name><description>SCL remained LOW for 25 ms</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PECERR</name>
              <description>PEC Error in reception</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>PECERR</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>no PEC error: receiver returns ACK after PEC reception (if ACK=1)</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>PEC error: receiver returns NACK after PEC reception (whatever ACK)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun/Underrun</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>OVR</name><usage>read-write</usage><enumeratedValue><name>NoOverrun</name><description>No overrun/underrun occured</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun/underrun occured</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AF</name>
              <description>Acknowledge failure</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>AF</name><usage>read-write</usage><enumeratedValue><name>NoFailure</name><description>No acknowledge failure</description><value>0</value></enumeratedValue><enumeratedValue><name>Failure</name><description>Acknowledge failure</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ARLO</name>
              <description>Arbitration lost (master
              mode)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ARLO</name><usage>read-write</usage><enumeratedValue><name>NoLost</name><description>No Arbitration Lost detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Lost</name><description>Arbitration Lost detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BERR</name>
              <description>Bus error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>BERR</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No misplaced Start or Stop condition</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>Misplaced Start or Stop condition</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TxE</name>
              <description>Data register empty
              (transmitters)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>TxE</name><usage>read-write</usage><enumeratedValue><name>NotEmpty</name><description>Data register not empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>Data register empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RxNE</name>
              <description>Data register not empty
              (receivers)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>RxNE</name><usage>read-write</usage><enumeratedValue><name>Empty</name><description>Data register empty</description><value>0</value></enumeratedValue><enumeratedValue><name>NotEmpty</name><description>Data register not empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>STOPF</name>
              <description>Stop detection (slave
              mode)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>STOPF</name><usage>read-write</usage><enumeratedValue><name>NoStop</name><description>No Stop condition detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Stop</name><description>Stop condition detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADD10</name>
              <description>10-bit header sent (Master
              mode)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BTF</name>
              <description>Byte transfer finished</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>BTF</name><usage>read-write</usage><enumeratedValue><name>NotFinished</name><description>Data byte transfer not done</description><value>0</value></enumeratedValue><enumeratedValue><name>Finished</name><description>Data byte transfer successful</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADDR</name>
              <description>Address sent (master mode)/matched
              (slave mode)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>ADDR</name><usage>read-write</usage><enumeratedValue><name>NotMatch</name><description>Adress mismatched or not received</description><value>0</value></enumeratedValue><enumeratedValue><name>Match</name><description>Received slave address matched with one of the enabled slave addresses</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SB</name>
              <description>Start bit (Master mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>SB</name><usage>read-write</usage><enumeratedValue><name>NoStart</name><description>No Start condition</description><value>0</value></enumeratedValue><enumeratedValue><name>Start</name><description>Start condition generated</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <displayName>SR2</displayName>
          <description>Status register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>PEC</name>
              <description>acket error checking
              register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DUALF</name>
              <description>Dual flag (Slave mode)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMBHOST</name>
              <description>SMBus host header (Slave
              mode)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMBDEFAULT</name>
              <description>SMBus device default address (Slave
              mode)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GENCALL</name>
              <description>General call address (Slave
              mode)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRA</name>
              <description>Transmitter/receiver</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Bus busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSL</name>
              <description>Master/slave</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>Clock control register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>F_S</name>
              <description>I2C master mode selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>F_S</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>Standard mode I2C</description><value>0</value></enumeratedValue><enumeratedValue><name>Fast</name><description>Fast mode I2C</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DUTY</name>
              <description>Fast mode duty cycle</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DUTY</name><usage>read-write</usage><enumeratedValue><name>Duty2_1</name><description>Duty cycle t_low/t_high = 2/1</description><value>0</value></enumeratedValue><enumeratedValue><name>Duty16_9</name><description>Duty cycle t_low/t_high = 16/9</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CCR</name>
              <description>Clock control register in Fast/Standard
              mode (Master mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE</name>
          <displayName>TRISE</displayName>
          <description>TRISE register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0002</resetValue>
          <fields>
            <field>
              <name>TRISE</name>
              <description>Maximum rise time in Fast/Standard mode
              (Master mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
