probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM7</name>
      <baseAddress>0x40001400</baseAddress>
      <interrupt>
        <name>TIM7</name>
        <description>TIM7 global interrupt</description>
        <value>55</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>Ethernet_MAC</name>
      <description>Ethernet: media access control
      (MAC)</description>
      <groupName>Ethernet</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x61</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ETH</name>
        <description>Ethernet global interrupt</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>ETH_WKUP</name>
        <description>Ethernet Wakeup through EXTI line
        interrupt</description>
        <value>62</value>
      </interrupt>
      <registers>
        <register>
          <name>MACCR</name>
          <displayName>MACCR</displayName>
          <description>Ethernet MAC configuration
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0008000</resetValue>
          <fields>
            <field>
              <name>RE</name>
              <description>Receiver enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MAC receive state machine is disabled after the completion of the reception of the current frame</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MAC receive state machine is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MAC transmit state machine is disabled after completion of the transmission of the current frame</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MAC transmit state machine is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DC</name>
              <description>Deferral check</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MAC defers until CRS signal goes inactive</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Deferral check function enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BL</name>
              <description>Back-off limit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>BL</name><usage>read-write</usage><enumeratedValue><name>BL10</name><description>For retransmission n, wait up to 2^min(n, 10) time slots</description><value>0</value></enumeratedValue><enumeratedValue><name>BL8</name><description>For retransmission n, wait up to 2^min(n, 8) time slots</description><value>1</value></enumeratedValue><enumeratedValue><name>BL4</name><description>For retransmission n, wait up to 2^min(n, 4) time slots</description><value>2</value></enumeratedValue><enumeratedValue><name>BL1</name><description>For retransmission n, wait up to 2^min(n, 1) time slots</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>APCS</name>
              <description>Automatic pad/CRC stripping</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>APCS</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MAC passes all incoming frames unmodified</description><value>0</value></enumeratedValue><enumeratedValue><name>Strip</name><description>MAC strips the Pad/FCS field on incoming frames only for lengths less than or equal to 1500 bytes</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RD</name>
              <description>Retry disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>MAC attempts retries based on the settings of BL</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>MAC attempts only 1 transmission</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IPCO</name>
              <description>IPv4 checksum offload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>IPCO</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>IPv4 checksum offload disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Offload</name><description>IPv4 checksums are checked in received frames</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DM</name>
              <description>Duplex mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DM</name><usage>read-write</usage><enumeratedValue><name>HalfDuplex</name><description>MAC operates in half-duplex mode</description><value>0</value></enumeratedValue><enumeratedValue><name>FullDuplex</name><description>MAC operates in full-duplex mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LM</name>
              <description>Loopback mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LM</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>Normal mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Loopback</name><description>MAC operates in loopback mode at the MII</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ROD</name>
              <description>Receive own disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ROD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>MAC receives all packets from PHY while transmitting</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>MAC disables reception of frames in half-duplex mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FES</name>
              <description>Fast Ethernet speed</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FES</name><usage>read-write</usage><enumeratedValue><name>FES10</name><description>10 Mbit/s</description><value>0</value></enumeratedValue><enumeratedValue><name>FES100</name><description>100 Mbit/s</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CSD</name>
              <description>Carrier sense disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CSD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Errors generated due to loss of carrier</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>No error generated due to loss of carrier</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IFG</name>
              <description>Interframe gap</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>IFG</name><usage>read-write</usage><enumeratedValue><name>IFG96</name><description>96 bit times</description><value>0</value></enumeratedValue><enumeratedValue><name>IFG88</name><description>88 bit times</description><value>1</value></enumeratedValue><enumeratedValue><name>IFG80</name><description>48 bit times</description><value>6</value></enumeratedValue><enumeratedValue><name>IFG40</name><description>40 bit times</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JD</name>
              <description>Jabber disable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Jabber enabled, transmit frames up to 2048 bytes</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Jabber disabled, transmit frames up to 16384 bytes</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WD</name>
              <description>Watchdog disable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Watchdog enabled, receive frames limited to 2048 bytes</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Watchdog disabled, receive frames may be up to to 16384 bytes</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CSTF</name>
              <description>CRC stripping for type frames</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CSTF</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CRC not stripped</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CRC stripped</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACFFR</name>
          <displayName>MACFFR</displayName>
          <description>Ethernet MAC frame filter
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PM</name>
              <description>Promiscuous mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Normal address filtering</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Address filters pass all incoming frames regardless of their destination or source address</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HU</name>
              <description>Hash unicast</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>HU</name><usage>read-write</usage><enumeratedValue><name>Perfect</name><description>MAC performs a perfect destination address filtering for unicast frames</description><value>0</value></enumeratedValue><enumeratedValue><name>Hash</name><description>MAC performs destination address filtering of received unicast frames according to the hash table</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HM</name>
              <description>Hash multicast</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>HM</name><usage>read-write</usage><enumeratedValue><name>Perfect</name><description>MAC performs a perfect destination address filtering for multicast frames</description><value>0</value></enumeratedValue><enumeratedValue><name>Hash</name><description>MAC performs destination address filtering of received multicast frames according to the hash table</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DAIF</name>
              <description>Destination address unique filtering</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DAIF</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>Normal filtering of frames</description><value>0</value></enumeratedValue><enumeratedValue><name>Invert</name><description>Address check block operates in inverse filtering mode for the DA address comparison</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PAM</name>
              <description>Pass all multicast</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PAM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Filtering of multicast frames depends on HM</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>All received frames with a multicast destination address are passed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BFD</name>
              <description>Broadcast frames disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BFD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Address filters pass all received broadcast frames</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Address filters filter all incoming broadcast frames</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PCF</name>
              <description>Pass control frames</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PCF</name><usage>read-write</usage><enumeratedValue><name>PreventAll</name><description>MAC prevents all control frames from reaching the application</description><value>0</value></enumeratedValue><enumeratedValue><name>ForwardAllExceptPause</name><description>MAC forwards all control frames to application except Pause</description><value>1</value></enumeratedValue><enumeratedValue><name>ForwardAll</name><description>MAC forwards all control frames to application even if they fail the address filter</description><value>2</value></enumeratedValue><enumeratedValue><name>ForwardAllFiltered</name><description>MAC forwards control frames that pass the address filter</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SAIF</name>
              <description>Source address inverse filtering</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SAIF</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>Source address filter operates normally</description><value>0</value></enumeratedValue><enumeratedValue><name>Invert</name><description>Source address filter operation inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SAF</name>
              <description>Source address filter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SAF</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Source address ignored</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MAC drops frames that fail the source address filter</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HPF</name>
              <description>Hash or perfect filter</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>HPF</name><usage>read-write</usage><enumeratedValue><name>HashOnly</name><description>If HM or HU is set, only frames that match the Hash filter are passed</description><value>0</value></enumeratedValue><enumeratedValue><name>HashOrPerfect</name><description>If HM or HU is set, frames that match either the perfect filter or the hash filter are passed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RA</name>
              <description>Receive all</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RA</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MAC receiver passes on to the application only those frames that have passed the SA/DA address file</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MAC receiver passes oll received frames on to the application</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACHTHR</name>
          <displayName>MACHTHR</displayName>
          <description>Ethernet MAC hash table high
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTH</name>
              <description>Upper 32 bits of hash table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACHTLR</name>
          <displayName>MACHTLR</displayName>
          <description>Ethernet MAC hash table low
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTL</name>
              <description>Lower 32 bits of hash table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACMIIAR</name>
          <displayName>MACMIIAR</displayName>
          <description>Ethernet MAC MII address
          register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MB</name>
              <description>MII busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MB</name><usage>read-write</usage><enumeratedValue><name>Busy</name><description>This bit is set to 1 by the application to indicate that a read or write access is in progress</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MW</name>
              <description>MII write</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MW</name><usage>read-write</usage><enumeratedValue><name>Read</name><description>Read operation</description><value>0</value></enumeratedValue><enumeratedValue><name>Write</name><description>Write operation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CR</name>
              <description>Clock range</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>CR</name><usage>read-write</usage><enumeratedValue><name>CR_60_100</name><description>60-100MHz HCLK/42</description><value>0</value></enumeratedValue><enumeratedValue><name>CR_100_150</name><description>100-150 MHz HCLK/62</description><value>1</value></enumeratedValue><enumeratedValue><name>CR_20_35</name><description>20-35MHz HCLK/16</description><value>2</value></enumeratedValue><enumeratedValue><name>CR_35_60</name><description>35-60MHz HCLK/16</description><value>3</value></enumeratedValue><enumeratedValue><name>CR_150_168</name><description>150-168MHz HCLK/102</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MR</name>
              <description>MII register - select the desired MII register in the PHY device</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>PA</name>
              <description>PHY address - select which of possible 32 PHYs is being accessed</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACMIIDR</name>
          <displayName>MACMIIDR</displayName>
          <description>Ethernet MAC MII data register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MD</name>
              <description>MII data read from/written to the PHY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
