probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
        <register>
          <name>MACA3HR</name>
          <displayName>MACA3HR</displayName>
          <description>Ethernet MAC address 3 high
          register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>MACA3H</name>
              <description>MACA3H</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MBC</name>
              <description>MBC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SA</name>
              <description>SA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SA</name><usage>read-write</usage><enumeratedValue><name>Destination</name><description>This address is used for comparison with DA fields of the received frame</description><value>0</value></enumeratedValue><enumeratedValue><name>Source</name><description>This address is used for comparison with SA fields of received frames</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AE</name>
              <description>AE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Address filters ignore this address</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Address filters use this address</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA3LR</name>
          <displayName>MACA3LR</displayName>
          <description>Ethernet MAC address 3 low
          register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MACA3L</name>
              <description>MBCA3L</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>Ethernet_MMC</name>
      <description>Ethernet: MAC management counters</description>
      <groupName>Ethernet</groupName>
      <baseAddress>0x40028100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MMCCR</name>
          <displayName>MMCCR</displayName>
          <description>Ethernet MMC control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CR</name>
              <description>Counter reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CR</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>Reset all counters. Cleared automatically</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CSR</name>
              <description>Counter stop rollover</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CSR</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Counters roll over to zero after reaching the maximum value</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Counters do not roll over to zero after reaching the maximum value</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ROR</name>
              <description>Reset on read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ROR</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MMC counters do not reset on read</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MMC counters reset to zero after read</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MCF</name>
              <description>MMC counter freeze</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MCF</name><usage>read-write</usage><enumeratedValue><name>Unfrozen</name><description>All MMC counters update normally</description><value>0</value></enumeratedValue><enumeratedValue><name>Frozen</name><description>All MMC counters frozen to their current value</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MCP</name>
              <description>MMC counter preset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MCP</name><usage>read-write</usage><enumeratedValue><name>Preset</name><description>MMC counters will be preset to almost full or almost half. Cleared automatically</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MCFHP</name>
              <description>MMC counter Full-Half preset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MCFHP</name><usage>read-write</usage><enumeratedValue><name>AlmostHalf</name><description>When MCP is set, MMC counters are preset to almost-half value 0x7FFF_FFF0</description><value>0</value></enumeratedValue><enumeratedValue><name>AlmostFull</name><description>When MCP is set, MMC counters are preset to almost-full value 0xFFFF_FFF0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRIR</name>
          <displayName>MMCRIR</displayName>
          <description>Ethernet MMC receive interrupt
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFCES</name>
              <description>Received frames CRC error status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFAES</name>
              <description>Received frames alignment error status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RGUFS</name>
              <description>Received good Unicast frames status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTIR</name>
          <displayName>MMCTIR</displayName>
          <description>Ethernet MMC transmit interrupt
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFSCS</name>
              <description>Transmitted good frames single collision status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TGFMSCS</name>
              <description>Transmitted good frames more than single collision status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TGFS</name>
              <description>Transmitted good frames status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRIMR</name>
          <displayName>MMCRIMR</displayName>
          <description>Ethernet MMC receive interrupt mask
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFCEM</name>
              <description>Received frame CRC error mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RFCEM</name><usage>read-write</usage><enumeratedValue><name>Unmasked</name><description>Received-crc-error counter half-full interrupt enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Masked</name><description>Received-crc-error counter half-full interrupt disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RFAEM</name>
              <description>Received frames alignment error mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RFAEM</name><usage>read-write</usage><enumeratedValue><name>Unmasked</name><description>Received-alignment-error counter half-full interrupt enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Masked</name><description>Received-alignment-error counter half-full interrupt disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RGUFM</name>
              <description>Received good Unicast frames mask</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RGUFM</name><usage>read-write</usage><enumeratedValue><name>Unmasked</name><description>Received-good-unicast counter half-full interrupt enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Masked</name><description>Received-good-unicast counter half-full interrupt disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTIMR</name>
          <displayName>MMCTIMR</displayName>
          <description>Ethernet MMC transmit interrupt mask
          register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFSCM</name>
              <description>Transmitted good frames single collision mask</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TGFSCM</name><usage>read-write</usage><enumeratedValue><name>Unmasked</name><description>Transmitted-good-single-collision half-full interrupt enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Masked</name><description>Transmitted-good-single-collision half-full interrupt disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TGFMSCM</name>
              <description>Transmitted good frames more than single collision mask</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TGFMSCM</name><usage>read-write</usage><enumeratedValue><name>Unmasked</name><description>Transmitted-good-multiple-collision half-full interrupt enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Masked</name><description>Transmitted-good-multiple-collision half-full interrupt disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TGFM</name>
              <description>Transmitted good frames mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TGFM</name><usage>read-write</usage><enumeratedValue><name>Unmasked</name><description>Transmitted-good counter half-full interrupt enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Masked</name><description>Transmitted-good counter half-full interrupt disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTGFSCCR</name>
          <displayName>MMCTGFSCCR</displayName>
          <description>Ethernet MMC transmitted good frames after a
          single collision counter</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFSCC</name>
              <description>Transmitted good frames single collision counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTGFMSCCR</name>
          <displayName>MMCTGFMSCCR</displayName>
          <description>Ethernet MMC transmitted good frames after
          more than a single collision</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFMSCC</name>
              <description>TGFMSCC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTGFCR</name>
          <displayName>MMCTGFCR</displayName>
          <description>Ethernet MMC transmitted good frames counter
          register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFC</name>
              <description>HTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRFCECR</name>
          <displayName>MMCRFCECR</displayName>
          <description>Ethernet MMC received frames with CRC error
          counter register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFCFC</name>
              <description>RFCFC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRFAECR</name>
          <displayName>MMCRFAECR</displayName>
          <description>Ethernet MMC received frames with alignment
          error counter register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFAEC</name>
              <description>RFAEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRGUFCR</name>
          <displayName>MMCRGUFCR</displayName>
          <description>MMC received good unicast frames counter
          register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RGUFC</name>
              <description>RGUFC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
