probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
        <register>
          <name>RF%sR</name>
          <displayName>RF0R</displayName>
          <description>receive FIFO 0 register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFOM</name>
              <description>RFOM0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>RFOM0W</name><usage>write</usage><enumeratedValue><name>Release</name><description>Set by software to release the output mailbox of the FIFO</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FOVR</name>
              <description>FOVR0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>FOVR0R</name><usage>read</usage><enumeratedValue><name>NoOverrun</name><description>No FIFO x overrun</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>FIFO x overrun</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>FOVR0W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FULL</name>
              <description>FULL0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>FULL0R</name><usage>read</usage><enumeratedValue><name>NotFull</name><description>FIFO x is not full</description><value>0</value></enumeratedValue><enumeratedValue><name>Full</name><description>FIFO x is full</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>FULL0W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FMP</name>
              <description>FMP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        <dim>2</dim><dimIndex>0,1</dimIndex><dimIncrement>0x4</dimIncrement></register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLKIE</name>
              <description>SLKIE</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SLKIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt when SLAKI bit is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generated when SLAKI bit is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WKUIE</name>
              <description>WKUIE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WKUIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt when WKUI is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generated when WKUI bit is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ERRIE</name>
              <description>ERRIE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ERRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt will be generated when an error condition is pending in the CAN_ESR</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An interrupt will be generation when an error condition is pending in the CAN_ESR</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LECIE</name>
              <description>LECIE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LECIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ERRI bit will not be set when the error code in LEC[2:0] is set by hardware on error detection</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ERRI bit will be set when the error code in LEC[2:0] is set by hardware on error detection</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BOFIE</name>
              <description>BOFIE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BOFIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ERRI bit will not be set when BOFF is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ERRI bit will be set when BOFF is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EPVIE</name>
              <description>EPVIE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EPVIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ERRI bit will not be set when EPVF is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ERRI bit will be set when EPVF is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EWGIE</name>
              <description>EWGIE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EWGIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ERRI bit will not be set when EWGF is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ERRI bit will be set when EWGF is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FOVIE1</name>
              <description>FOVIE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FOVIE1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt when FOVR is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generation when FOVR is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FFIE1</name>
              <description>FFIE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FFIE1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt when FULL bit is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generated when FULL bit is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FMPIE1</name>
              <description>FMPIE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FMPIE1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt generated when state of FMP[1:0] bits are not 00b</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generated when state of FMP[1:0] bits are not 00b</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FOVIE0</name>
              <description>FOVIE0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FOVIE0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt when FOVR bit is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generated when FOVR bit is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FFIE0</name>
              <description>FFIE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FFIE0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt when FULL bit is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generated when FULL bit is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FMPIE0</name>
              <description>FMPIE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FMPIE0</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt generated when state of FMP[1:0] bits are not 00</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generated when state of FMP[1:0] bits are not 00b</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TMEIE</name>
              <description>TMEIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TMEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No interrupt when RQCPx bit is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt generated when RQCPx bit is set</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ESR</name>
          <displayName>ESR</displayName>
          <description>interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REC</name>
              <description>REC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEC</name>
              <description>TEC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LEC</name>
              <description>LEC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>LEC</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No Error</description><value>0</value></enumeratedValue><enumeratedValue><name>Stuff</name><description>Stuff Error</description><value>1</value></enumeratedValue><enumeratedValue><name>Form</name><description>Form Error</description><value>2</value></enumeratedValue><enumeratedValue><name>Ack</name><description>Acknowledgment Error</description><value>3</value></enumeratedValue><enumeratedValue><name>BitRecessive</name><description>Bit recessive Error</description><value>4</value></enumeratedValue><enumeratedValue><name>BitDominant</name><description>Bit dominant Error</description><value>5</value></enumeratedValue><enumeratedValue><name>Crc</name><description>CRC Error</description><value>6</value></enumeratedValue><enumeratedValue><name>Custom</name><description>Set by software</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BOFF</name>
              <description>BOFF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPVF</name>
              <description>EPVF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EWGF</name>
              <description>EWGF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR</name>
          <displayName>BTR</displayName>
          <description>bit timing register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SILM</name>
              <description>SILM</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SILM</name><usage>read-write</usage><enumeratedValue><name>Normal</name><description>Normal operation</description><value>0</value></enumeratedValue><enumeratedValue><name>Silent</name><description>Silent Mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LBKM</name>
              <description>LBKM</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LBKM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Loop Back Mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Loop Back Mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SJW</name>
              <description>SJW</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TS2</name>
              <description>TS2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TS1</name>
              <description>TS1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BRP</name>
              <description>BRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMR</name>
          <displayName>FMR</displayName>
          <description>filter master register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x2A1C0E01</resetValue>
          <fields>
            <field>
              <name>CAN2SB</name>
              <description>CAN2SB</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FINIT</name>
              <description>FINIT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FM1R</name>
          <displayName>FM1R</displayName>
          <description>filter mode register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FBM0</name>
              <description>Filter mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM1</name>
              <description>Filter mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM2</name>
              <description>Filter mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM3</name>
              <description>Filter mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM4</name>
              <description>Filter mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM5</name>
              <description>Filter mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM6</name>
              <description>Filter mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM7</name>
              <description>Filter mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM8</name>
              <description>Filter mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM9</name>
              <description>Filter mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM10</name>
              <description>Filter mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM11</name>
              <description>Filter mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM12</name>
              <description>Filter mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM13</name>
              <description>Filter mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM14</name>
              <description>Filter mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM15</name>
              <description>Filter mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM16</name>
              <description>Filter mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM17</name>
              <description>Filter mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM18</name>
              <description>Filter mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM19</name>
              <description>Filter mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM20</name>
              <description>Filter mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM21</name>
              <description>Filter mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM22</name>
              <description>Filter mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM23</name>
              <description>Filter mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM24</name>
              <description>Filter mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM25</name>
              <description>Filter mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM26</name>
              <description>Filter mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBM27</name>
              <description>Filter mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
