probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
        <register>
          <name>TDLR</name>
          <displayName>TDL0R</displayName>
          <description>mailbox data low register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA3</name>
              <description>DATA3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA2</name>
              <description>DATA2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA1</name>
              <description>DATA1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA0</name>
              <description>DATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TDHR</name>
          <displayName>TDH0R</displayName>
          <description>mailbox data high register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA7</name>
              <description>DATA7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA6</name>
              <description>DATA6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA5</name>
              <description>DATA5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA4</name>
              <description>DATA4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <dim>3</dim><dimIndex>0,1,2</dimIndex><dimIncrement>0x10</dimIncrement></cluster><cluster><name>RX%s</name><description>CAN Receive cluster</description><addressOffset>0x1b0</addressOffset><register>
          <name>RIR</name>
          <displayName>RI0R</displayName>
          <description>receive FIFO mailbox identifier
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STID</name>
              <description>STID</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>EXID</name>
              <description>EXID</description>
              <bitOffset>3</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>IDE</name>
              <description>IDE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>IDE</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>Standard identifier</description><value>0</value></enumeratedValue><enumeratedValue><name>Extended</name><description>Extended identifier</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RTR</name>
              <description>RTR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RTR</name><usage>read-write</usage><enumeratedValue><name>Data</name><description>Data frame</description><value>0</value></enumeratedValue><enumeratedValue><name>Remote</name><description>Remote frame</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RDTR</name>
          <displayName>RDT0R</displayName>
          <description>mailbox data high register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIME</name>
              <description>TIME</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FMI</name>
              <description>FMI</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>8</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RDLR</name>
          <displayName>RDL0R</displayName>
          <description>mailbox data high register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA3</name>
              <description>DATA3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA2</name>
              <description>DATA2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA1</name>
              <description>DATA1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA0</name>
              <description>DATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDHR</name>
          <displayName>RDH0R</displayName>
          <description>receive FIFO mailbox data high
          register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA7</name>
              <description>DATA7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA6</name>
              <description>DATA6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA5</name>
              <description>DATA5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA4</name>
              <description>DATA4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <dim>2</dim><dimIndex>0,1</dimIndex><dimIncrement>0x10</dimIncrement></cluster><cluster><name>FB%s</name><description>CAN Filter Bank cluster</description><addressOffset>0x240</addressOffset><register>
          <name>FR1</name>
          <displayName>F0R1</displayName>
          <description>Filter bank 0 register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>FB</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>FR2</name>
          <displayName>F0R2</displayName>
          <description>Filter bank 0 register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>FB</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
