probe-rs/probe-rs/probe-rs/examples/stm32f407.svd
        <register>
          <name>SR</name>
          <displayName>ASR</displayName>
          <description>SAI AStatus register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>OVRUDR</name>
              <description>Overrun / underrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVRUDRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No overrun/underrun error</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun/underrun error detection</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUTEDET</name>
              <description>Mute detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MUTEDETR</name><usage>read</usage><enumeratedValue><name>NoMute</name><description>No MUTE detection on the SD input line</description><value>0</value></enumeratedValue><enumeratedValue><name>Mute</name><description>MUTE value detected on the SD input line (0 value) for a specified number of consecutive audio frame</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WCKCFG</name>
              <description>Wrong clock configuration
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WCKCFGR</name><usage>read</usage><enumeratedValue><name>Correct</name><description>Clock configuration is correct</description><value>0</value></enumeratedValue><enumeratedValue><name>Wrong</name><description>Clock configuration does not respect the rule concerning the frame length specification</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FREQ</name>
              <description>FIFO request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FREQR</name><usage>read</usage><enumeratedValue><name>NoRequest</name><description>No FIFO request</description><value>0</value></enumeratedValue><enumeratedValue><name>Request</name><description>FIFO request to read or to write the SAI_xDR</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CNRDY</name>
              <description>Codec not ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CNRDYR</name><usage>read</usage><enumeratedValue><name>Ready</name><description>External AC&#8217;97 Codec is ready</description><value>0</value></enumeratedValue><enumeratedValue><name>NotReady</name><description>External AC&#8217;97 Codec is not ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AFSDET</name>
              <description>Anticipated frame synchronization
              detection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AFSDETR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No error</description><value>0</value></enumeratedValue><enumeratedValue><name>EarlySync</name><description>Frame synchronization signal is detected earlier than expected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LFSDET</name>
              <description>Late frame synchronization
              detection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LFSDETR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No error</description><value>0</value></enumeratedValue><enumeratedValue><name>NoSync</name><description>Frame synchronization signal is not present at the right time</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FLVL</name>
              <description>FIFO level threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>FLVLR</name><usage>read</usage><enumeratedValue><name>Empty</name><description>FIFO empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter1</name><description>FIFO &lt;= 1&#8260;4 but not empty</description><value>1</value></enumeratedValue><enumeratedValue><name>Quarter2</name><description>1&#8260;4 &lt; FIFO &lt;= 1&#8260;2</description><value>2</value></enumeratedValue><enumeratedValue><name>Quarter3</name><description>1&#8260;2 &lt; FIFO &lt;= 3&#8260;4</description><value>3</value></enumeratedValue><enumeratedValue><name>Quarter4</name><description>3&#8260;4 &lt; FIFO but not full</description><value>4</value></enumeratedValue><enumeratedValue><name>Full</name><description>FIFO full</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRFR</name>
          <displayName>ACLRFR</displayName>
          <description>SAI AClear flag register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COVRUDR</name>
              <description>Clear overrun / underrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>COVRUDRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the OVRUDR flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMUTEDET</name>
              <description>Mute detection flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMUTEDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the MUTEDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CWCKCFG</name>
              <description>Clear wrong clock configuration
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CWCKCFGW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the WCKCFG flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CCNRDY</name>
              <description>Clear codec not ready flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CCNRDYW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the CNRDY flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CAFSDET</name>
              <description>Clear anticipated frame synchronization
              detection flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CAFSDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the AFSDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CLFSDET</name>
              <description>Clear late frame synchronization
              detection flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CLFSDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the LFSDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>ADR</displayName>
          <description>SAI AData register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <dim>2</dim><dimIndex>A,B</dimIndex><dimIncrement>0x20</dimIncrement></cluster></registers>
    </peripheral>
    <peripheral>
      <name>LTDC</name>
      <description>LCD-TFT Controller</description>
      <groupName>LTDC</groupName>
      <baseAddress>0x40016800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD_TFT</name>
        <description>LTDC global interrupt</description>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>LCD_TFT_1</name>
        <description>LTDC global error interrupt</description>
        <value>89</value>
      </interrupt>
      <registers>
        <register>
          <name>SSCR</name>
          <displayName>SSCR</displayName>
          <description>Synchronization Size Configuration
          Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HSW</name>
              <description>Horizontal Synchronization Width (in
              units of pixel clock period)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>VSH</name>
              <description>Vertical Synchronization Height (in
              units of horizontal scan line)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BPCR</name>
          <displayName>BPCR</displayName>
          <description>Back Porch Configuration
          Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AHBP</name>
              <description>Accumulated Horizontal back porch (in
              units of pixel clock period)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>AVBP</name>
              <description>Accumulated Vertical back porch (in
              units of horizontal scan line)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWCR</name>
          <displayName>AWCR</displayName>
          <description>Active Width Configuration
          Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AAW</name>
              <description>Accumulated Active Width (in units of pixel clock period)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>AAH</name>
              <description>Accumulated Active Height (in units of
              horizontal scan line)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TWCR</name>
          <displayName>TWCR</displayName>
          <description>Total Width Configuration
          Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TOTALW</name>
              <description>Total Width (in units of pixel clock
              period)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>TOTALH</name>
              <description>Total Height (in units of horizontal
              scan line)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCR</name>
          <displayName>GCR</displayName>
          <description>Global Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00002220</resetValue>
          <fields>
            <field>
              <name>HSPOL</name>
              <description>Horizontal Synchronization
              Polarity</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSPOL</name>
              <description>Vertical Synchronization
              Polarity</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEPOL</name>
              <description>Data Enable Polarity</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCPOL</name>
              <description>Pixel Clock Polarity</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEN</name>
              <description>Dither Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRW</name>
              <description>Dither Red Width</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DGW</name>
              <description>Dither Green Width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBW</name>
              <description>Dither Blue Width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LTDCEN</name>
              <description>LCD-TFT controller enable
              bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR</name>
          <displayName>SRCR</displayName>
          <description>Shadow Reload Configuration
          Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VBR</name>
              <description>Vertical Blanking Reload</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IMR</name>
              <description>Immediate Reload</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCCR</name>
          <displayName>BCCR</displayName>
          <description>Background Color Configuration
          Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BC</name>
              <description>Background Color Red value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RRIE</name>
              <description>Register Reload interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERRIE</name>
              <description>Transfer Error Interrupt
              Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FUIE</name>
              <description>FIFO Underrun Interrupt
              Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LIE</name>
              <description>Line Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>Interrupt Status Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RRIF</name>
              <description>Register Reload Interrupt
              Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERRIF</name>
              <description>Transfer Error interrupt
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FUIF</name>
              <description>FIFO Underrun Interrupt
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LIF</name>
              <description>Line Interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRRIF</name>
              <description>Clears Register Reload Interrupt
              Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTERRIF</name>
              <description>Clears the Transfer Error Interrupt
              Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFUIF</name>
              <description>Clears the FIFO Underrun Interrupt
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLIF</name>
              <description>Clears the Line Interrupt
              Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LIPCR</name>
          <displayName>LIPCR</displayName>
          <description>Line Interrupt Position Configuration
          Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LIPOS</name>
              <description>Line Interrupt Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSR</name>
          <displayName>CPSR</displayName>
          <description>Current Position Status
          Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CXPOS</name>
              <description>Current X Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>CYPOS</name>
              <description>Current Y Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
